### Selecting pandas series from a Dataframe

In [1]:
import pandas as pd
%matplotlib inline

In [2]:
ufo = pd.read_csv('http://bit.ly/uforeports')
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

If we want to look at the city column form the above dataset, we use the below the command.

Notice the result is a Series.

In [3]:
ufo['City'].head()

0                  Ithaca
1             Willingboro
2                 Holyoke
3                 Abilene
4    New York Worlds Fair
Name: City, dtype: object

We can also use:

In [4]:
ufo.City.head()

0                  Ithaca
1             Willingboro
2                 Holyoke
3                 Abilene
4    New York Worlds Fair
Name: City, dtype: object

If a column name has a space between the words (eg: Colors Reported), we can  not use the dot operation to select the column.
In this case we have to use the first method.

In [6]:
ufo['Colors Reported'].head()

0    NaN
1    NaN
2    NaN
3    NaN
4    NaN
Name: Colors Reported, dtype: object

This case also stands for columns that have same name as one of the pandas dataframe attributes.

For eg: If the column name is shape, then we cannot use dataframe.shape to select the column as dataframe.shape gives the dimensions of the dataframe.

In [8]:
ufo.shape

(18241, 5)

Let's answer the question 'How do we create a new pandas series in a dataframe?'.

Simple addition operation like we have for characters would work here too.
    
Just 'ab' + 'cd' gives abcd.

In [9]:
ufo.City + ' ' + ufo.State

0                      Ithaca NY
1                 Willingboro NJ
2                     Holyoke CO
3                     Abilene KS
4        New York Worlds Fair NY
5                 Valley City ND
6                 Crater Lake CA
7                        Alma MI
8                     Eklutna AK
9                     Hubbard OR
10                    Fontana CA
11                   Waterloo AL
12                     Belton SC
13                     Keokuk IA
14                  Ludington MI
15                Forest Home CA
16                Los Angeles CA
17                  Hapeville GA
18                     Oneida TN
19                 Bering Sea AK
20                   Nebraska NE
21                           NaN
22                           NaN
23                  Owensboro KY
24                 Wilderness WV
25                  San Diego CA
26                 Wilderness WV
27                     Clovis NM
28                 Los Alamos NM
29               Ft. Duschene UT
                  ...
18211                 Holyoke MA
18212                  Carson CA
18213                Pasadena CA
18214                  Austin TX
18215                El Campo TX
18216            Garden Grove CA
18217           Berthoud Pass CO
18218              Sisterdale TX
18219            Garden Grove CA
18220             Shasta Lake CA
18221                Franklin NH
18222          Albrightsville PA
18223              Greenville SC
18224                 Eufaula OK
18225             Simi Valley CA
18226           San Francisco CA
18227           San Francisco CA
18228              Kingsville TX
18229                 Chicago IL
18230             Pismo Beach CA
18231             Pismo Beach CA
18232                    Lodi WI
18233               Anchorage AK
18234                Capitola CA
18235          Fountain Hills AZ
18236              Grant Park IL
18237             Spirit Lake IA
18238             Eagle River WI
18239             Eagle River WI
18240                    Ybor FL
Length: 18241, dtype: object

This maybe used if we have to create a new column as Location in the dataframe

In [12]:
ufo['Location'] = ufo.City + ', ' + ufo.State
ufo.Location.head()

0                  Ithaca, NY
1             Willingboro, NJ
2                 Holyoke, CO
3                 Abilene, KS
4    New York Worlds Fair, NY
Name: Location, dtype: object

 The dot(.) operation does not work while creating a new column.